; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v9 ?v6)
             (pred_8 ?v3 ?v1)
             (pred_6 ?v9 ?v1)
             (pred_2 ?v12 ?v9 )
	     (pred_5 ?v9)
             (pred_7 ?v11)
             (pred_11 ?v3)
             (pred_9 ?v1)
             (pred_10 ?v9)
             (pred_1 ?v3)
             (pred_12 ?v9)
             (pred_3 ))



(:action op_2
:parameters (?v8 ?v4 ?v2 ?v7)
:precondition (and (pred_7 ?v8) (pred_7 ?v4) (pred_11 ?v2) (pred_9 ?v7)
          (pred_4 ?v8 ?v4) (pred_8 ?v2 ?v7)
                   (pred_6 ?v4 ?v7) (pred_5 ?v8) 
                   (pred_10 ?v4) (pred_1 ?v2))
:effect (and  (pred_12 ?v4) (not (pred_10 ?v4))))


(:action op_4
:parameters (?v8 ?v13)
:precondition (and (pred_7 ?v8) (pred_7 ?v13)
               (pred_5 ?v8) (pred_4 ?v8 ?v13) (pred_12 ?v13))
:effect (and (pred_5 ?v13) (not (pred_5 ?v8))))

(:action op_3
:parameters (?v8 ?v2)
:precondition (and (pred_7 ?v8) (pred_11 ?v2) 
                  (pred_5 ?v8) (pred_2 ?v2 ?v8) (pred_3 ))
:effect (and (pred_1 ?v2)
   (not (pred_2 ?v2 ?v8)) (not (pred_3 ))))


(:action op_5
:parameters (?v8 ?v5 ?v10)
:precondition (and (pred_7 ?v8) (pred_11 ?v5) (pred_11 ?v10)
                  (pred_5 ?v8) (pred_1 ?v10) (pred_2 ?v5 ?v8))
:effect (and (pred_1 ?v5) (pred_2 ?v10 ?v8)
        (not (pred_1 ?v10)) (not (pred_2 ?v5 ?v8))))

(:action op_1
:parameters (?v8 ?v2)
:precondition (and (pred_7 ?v8) (pred_11 ?v2) 
                  (pred_5 ?v8) (pred_1 ?v2))
:effect (and (pred_3 ) (pred_2 ?v2 ?v8) (not (pred_1 ?v2)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_24 obj_01 obj_14 obj_26 obj_09 obj_17 obj_08 obj_07 obj_18 obj_20 obj_16 obj_31 obj_22 obj_10 obj_02 obj_19 obj_25 obj_29 obj_06 obj_27 obj_21 obj_23 obj_05 obj_03 obj_30
    obj_11 obj_04 obj_12
    obj_28 obj_15 obj_13
    )

    (:init
       (pred_3)

       (pred_7 obj_24)
       (pred_7 obj_01)
       (pred_7 obj_14)
       (pred_7 obj_26)
       (pred_7 obj_09)
       (pred_7 obj_17)
       (pred_7 obj_08)
       (pred_7 obj_07)
       (pred_7 obj_18)
       (pred_7 obj_20)
       (pred_7 obj_16)
       (pred_7 obj_31)
       (pred_7 obj_22)
       (pred_7 obj_10)
       (pred_7 obj_02)
       (pred_7 obj_19)
       (pred_7 obj_25)
       (pred_7 obj_29)
       (pred_7 obj_06)
       (pred_7 obj_27)
       (pred_7 obj_21)
       (pred_7 obj_23)
       (pred_7 obj_05)
       (pred_7 obj_03)
       (pred_7 obj_30)
       (pred_9 obj_11)
       (pred_9 obj_04)
       (pred_9 obj_12)
       (pred_11 obj_28)
       (pred_11 obj_15)
       (pred_11 obj_13)

       (pred_4 obj_24 obj_17)
       (pred_4 obj_24 obj_01)
       (pred_4 obj_01 obj_08)
       (pred_4 obj_01 obj_14)
       (pred_4 obj_01 obj_24)
       (pred_4 obj_14 obj_07)
       (pred_4 obj_14 obj_26)
       (pred_4 obj_14 obj_01)
       (pred_4 obj_26 obj_18)
       (pred_4 obj_26 obj_09)
       (pred_4 obj_26 obj_14)
       (pred_4 obj_09 obj_20)
       (pred_4 obj_09 obj_26)
       (pred_4 obj_17 obj_16)
       (pred_4 obj_17 obj_08)
       (pred_4 obj_17 obj_24)
       (pred_4 obj_08 obj_31)
       (pred_4 obj_08 obj_07)
       (pred_4 obj_08 obj_01)
       (pred_4 obj_08 obj_17)
       (pred_4 obj_07 obj_22)
       (pred_4 obj_07 obj_18)
       (pred_4 obj_07 obj_14)
       (pred_4 obj_07 obj_08)
       (pred_4 obj_18 obj_10)
       (pred_4 obj_18 obj_20)
       (pred_4 obj_18 obj_26)
       (pred_4 obj_18 obj_07)
       (pred_4 obj_20 obj_02)
       (pred_4 obj_20 obj_09)
       (pred_4 obj_20 obj_18)
       (pred_4 obj_16 obj_19)
       (pred_4 obj_16 obj_31)
       (pred_4 obj_16 obj_17)
       (pred_4 obj_31 obj_25)
       (pred_4 obj_31 obj_22)
       (pred_4 obj_31 obj_08)
       (pred_4 obj_31 obj_16)
       (pred_4 obj_22 obj_29)
       (pred_4 obj_22 obj_10)
       (pred_4 obj_22 obj_07)
       (pred_4 obj_22 obj_31)
       (pred_4 obj_10 obj_06)
       (pred_4 obj_10 obj_02)
       (pred_4 obj_10 obj_18)
       (pred_4 obj_10 obj_22)
       (pred_4 obj_02 obj_27)
       (pred_4 obj_02 obj_20)
       (pred_4 obj_02 obj_10)
       (pred_4 obj_19 obj_21)
       (pred_4 obj_19 obj_25)
       (pred_4 obj_19 obj_16)
       (pred_4 obj_25 obj_23)
       (pred_4 obj_25 obj_29)
       (pred_4 obj_25 obj_31)
       (pred_4 obj_25 obj_19)
       (pred_4 obj_29 obj_05)
       (pred_4 obj_29 obj_06)
       (pred_4 obj_29 obj_22)
       (pred_4 obj_29 obj_25)
       (pred_4 obj_06 obj_03)
       (pred_4 obj_06 obj_27)
       (pred_4 obj_06 obj_10)
       (pred_4 obj_06 obj_29)
       (pred_4 obj_27 obj_30)
       (pred_4 obj_27 obj_02)
       (pred_4 obj_27 obj_06)
       (pred_4 obj_21 obj_23)
       (pred_4 obj_21 obj_19)
       (pred_4 obj_23 obj_05)
       (pred_4 obj_23 obj_25)
       (pred_4 obj_23 obj_21)
       (pred_4 obj_05 obj_03)
       (pred_4 obj_05 obj_29)
       (pred_4 obj_05 obj_23)
       (pred_4 obj_03 obj_30)
       (pred_4 obj_03 obj_06)
       (pred_4 obj_03 obj_05)
       (pred_4 obj_30 obj_27)
       (pred_4 obj_30 obj_03)
       (pred_10 obj_16)
       (pred_10 obj_14)
       (pred_10 obj_01)
       (pred_6  obj_16 obj_11)
       (pred_6  obj_14 obj_04)
       (pred_6  obj_01 obj_12)
       (pred_12 obj_24)
       (pred_12 obj_26)
       (pred_12 obj_09)
       (pred_12 obj_17)
       (pred_12 obj_08)
       (pred_12 obj_07)
       (pred_12 obj_18)
       (pred_12 obj_20)
       (pred_12 obj_31)
       (pred_12 obj_22)
       (pred_12 obj_10)
       (pred_12 obj_02)
       (pred_12 obj_19)
       (pred_12 obj_25)
       (pred_12 obj_29)
       (pred_12 obj_06)
       (pred_12 obj_27)
       (pred_12 obj_21)
       (pred_12 obj_23)
       (pred_12 obj_05)
       (pred_12 obj_03)
       (pred_12 obj_30)

       (pred_8  obj_28 obj_11)
       (pred_8  obj_15 obj_04)
       (pred_8  obj_13 obj_12)
       (pred_2 obj_28 obj_22)
       (pred_2 obj_15 obj_08)
       (pred_2 obj_13 obj_09)
       (pred_5 obj_18)
    )

    (:goal (and
       (pred_2 obj_28 obj_03)
       (pred_2 obj_15 obj_27)
       (pred_2 obj_13 obj_21)
    ))
(:constraints
  (always (not (pred_5 obj_06)))
)
)

; plan
1. (op_4 obj_18 obj_07)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_07)
   goals met: 0 of 3
2. (op_4 obj_07 obj_22)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_22)
   goals met: 0 of 3
3. (op_3 obj_22 obj_28)
   deleted: (pred_2 obj_28 obj_22) (pred_3)
   added: (pred_1 obj_28)
   goals met: 0 of 3
4. (op_4 obj_22 obj_29)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_29)
   goals met: 0 of 3
5. (op_4 obj_29 obj_05)
   deleted: (pred_5 obj_29)
   added: (pred_5 obj_05)
   goals met: 0 of 3
6. (op_4 obj_05 obj_03)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_03)
   goals met: 0 of 3
7. (op_1 obj_03 obj_28)
   deleted: (pred_1 obj_28)
   added: (pred_3) (pred_2 obj_28 obj_03)
   goals met: 1 of 3
8. (op_4 obj_03 obj_30)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_30)
   goals met: 1 of 3
9. (op_4 obj_30 obj_27)
   deleted: (pred_5 obj_30)
   added: (pred_5 obj_27)
   goals met: 1 of 3
10. (op_4 obj_27 obj_02)
   deleted: (pred_5 obj_27)
   added: (pred_5 obj_02)
   goals met: 1 of 3
11. (op_4 obj_02 obj_20)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_20)
   goals met: 1 of 3
12. (op_4 obj_20 obj_18)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_18)
   goals met: 1 of 3
13. (op_4 obj_18 obj_07)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_07)
   goals met: 1 of 3
14. (op_4 obj_07 obj_08)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_08)
   goals met: 1 of 3
15. (op_3 obj_08 obj_15)
   deleted: (pred_2 obj_15 obj_08) (pred_3)
   added: (pred_1 obj_15)
   goals met: 1 of 3
16. (op_4 obj_08 obj_07)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_07)
   goals met: 1 of 3
17. (op_4 obj_07 obj_18)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_18)
   goals met: 1 of 3
18. (op_4 obj_18 obj_20)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_20)
   goals met: 1 of 3
19. (op_4 obj_20 obj_02)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_02)
   goals met: 1 of 3
20. (op_4 obj_02 obj_27)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_27)
   goals met: 1 of 3
21. (op_1 obj_27 obj_15)
   deleted: (pred_1 obj_15)
   added: (pred_3) (pred_2 obj_15 obj_27)
   goals met: 2 of 3
22. (op_4 obj_27 obj_02)
   deleted: (pred_5 obj_27)
   added: (pred_5 obj_02)
   goals met: 2 of 3
23. (op_4 obj_02 obj_20)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_20)
   goals met: 2 of 3
24. (op_4 obj_20 obj_09)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_09)
   goals met: 2 of 3
25. (op_3 obj_09 obj_13)
   deleted: (pred_2 obj_13 obj_09) (pred_3)
   added: (pred_1 obj_13)
   goals met: 2 of 3
26. (op_4 obj_09 obj_26)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_26)
   goals met: 2 of 3
27. (op_4 obj_26 obj_18)
   deleted: (pred_5 obj_26)
   added: (pred_5 obj_18)
   goals met: 2 of 3
28. (op_4 obj_18 obj_07)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_07)
   goals met: 2 of 3
29. (op_4 obj_07 obj_08)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_08)
   goals met: 2 of 3
30. (op_4 obj_08 obj_31)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_31)
   goals met: 2 of 3
31. (op_4 obj_31 obj_25)
   deleted: (pred_5 obj_31)
   added: (pred_5 obj_25)
   goals met: 2 of 3
32. (op_4 obj_25 obj_19)
   deleted: (pred_5 obj_25)
   added: (pred_5 obj_19)
   goals met: 2 of 3
33. (op_4 obj_19 obj_21)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_21)
   goals met: 2 of 3
34. (op_1 obj_21 obj_13)
   deleted: (pred_1 obj_13)
   added: (pred_3) (pred_2 obj_13 obj_21)
   goals met: 3 of 3
